; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v7)
		(pred_2 ?v3)
		(pred_5 ?v8)
		(pred_1 ?v8)
		(pred_6 ?v3 ?v8)
		(pred_4)
		(pred_3 ?v3))

   (:action op_1
       :parameters  (?v2 ?v1)
       :precondition (and (not-eq ?v2 ?v1) 
                          (pred_5 ?v2) (pred_5 ?v1) (pred_1 ?v2))
       :effect (and  (pred_1 ?v1)
		     (not (pred_1 ?v2))))


   (:action op_2
       :parameters (?v5 ?v6)
       :precondition  (and  (pred_2 ?v5) (pred_5 ?v6)
			    (pred_6 ?v5 ?v6) (pred_1 ?v6) (pred_4))
       :effect (and (pred_3 ?v5)
		    (not (pred_6 ?v5 ?v6)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v5  ?v6)
       :precondition  (and  (pred_2 ?v5) (pred_5 ?v6)
			    (pred_3 ?v5) (pred_1 ?v6))
       :effect (and (pred_6 ?v5 ?v6)
		    (pred_4)
		    (not (pred_3 ?v5)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_06 obj_02 obj_05 obj_04 
          obj_01 obj_07 obj_03 
)
(:init
(pred_5 obj_06)
(pred_5 obj_02)
(pred_5 obj_05)
(pred_5 obj_04)
(pred_2 obj_01)
(pred_2 obj_07)
(pred_2 obj_03)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(pred_4)
(pred_6 obj_01 obj_02)
(pred_6 obj_07 obj_06)
(pred_6 obj_03 obj_05)
(pred_1 obj_02)
)
(:goal
(and
(pred_6 obj_01 obj_04)
(pred_6 obj_07 obj_04)
(pred_6 obj_03 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_01 obj_04) (pred_1 obj_06))
    (sometime-before  (pred_6 obj_07 obj_04) (pred_1 obj_05))
    (sometime-before  (pred_6 obj_03 obj_04) (pred_1 obj_06))
  )
)
)

; plan
1. (op_2 obj_01 obj_02)
   deleted: (pred_6 obj_01 obj_02) (pred_4)
   added: (pred_3 obj_01)
   goals met: 0 of 3
2. (op_1 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 0 of 3
3. (op_1 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 0 of 3
4. (op_3 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_05) (pred_4)
   goals met: 0 of 3
5. (op_1 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_06)
   goals met: 0 of 3
6. (op_2 obj_07 obj_06)
   deleted: (pred_6 obj_07 obj_06) (pred_4)
   added: (pred_3 obj_07)
   goals met: 0 of 3
7. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 0 of 3
8. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_6 obj_07 obj_04) (pred_4)
   goals met: 1 of 3
9. (op_1 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 1 of 3
10. (op_2 obj_03 obj_05)
   deleted: (pred_6 obj_03 obj_05) (pred_4)
   added: (pred_3 obj_03)
   goals met: 1 of 3
11. (op_1 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_04)
   goals met: 1 of 3
12. (op_3 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_6 obj_03 obj_04) (pred_4)
   goals met: 2 of 3
13. (op_1 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 2 of 3
14. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01 obj_05) (pred_4)
   added: (pred_3 obj_01)
   goals met: 2 of 3
15. (op_1 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_04)
   goals met: 2 of 3
16. (op_3 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_04) (pred_4)
   goals met: 3 of 3
